In [1]:
# Importing modules
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from matplotlib import gridspec
%matplotlib inline
sns.set(color_codes=True)

In [2]:
# read the dataset
spreadsheet=pd.read_csv('/Users/Hp/Downloads/NSE_data_all_stocks_2015.csv')

In [3]:
spreadsheet.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16386 entries, 0 to 16385
Data columns (total 13 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   DATE       16386 non-null  object
 1   CODE       16386 non-null  object
 2   NAME       16386 non-null  object
 3   12m Low    16386 non-null  object
 4   12m High   16386 non-null  object
 5   Day Low    16386 non-null  object
 6   Day High   16386 non-null  object
 7   Day Price  16386 non-null  object
 8   Previous   16386 non-null  object
 9   Change     16386 non-null  object
 10  Change%    16386 non-null  object
 11  Volume     16386 non-null  object
 12  Adjust     16386 non-null  object
dtypes: object(13)
memory usage: 1.6+ MB

In [4]:
spreadsheet.describe()

,DATE,CODE,NAME,12m Low,12m High,Day Low,Day High,Day Price,Previous,Change,Change%,Volume,Adjust
count,16386,16386,16386,16386,16386,16386,16386,16386,16386,16386,16386,16386,16386
unique,251,67,67,99,107,2027,2037,2514,2512,841,865,4280,1132
top,31-Dec-15,EGAD,Eaagads Ltd,2,55.5,5.5,5.5,5.5,5.5,-,-,-,-
freq,67,251,251,489,502,395,399,379,378,5357,5361,3732,12791

In [5]:
spreadsheet.columns

Index(['DATE', 'CODE', 'NAME', '12m Low', '12m High', 'Day Low', 'Day High',
       'Day Price', 'Previous', 'Change', 'Change%', 'Volume', 'Adjust'],
      dtype='object')

In [6]:
spreadsheet.dtypes

DATE         object
CODE         object
NAME         object
12m Low      object
12m High     object
Day Low      object
Day High     object
Day Price    object
Previous     object
Change       object
Change%      object
Volume       object
Adjust       object
dtype: object

In [7]:
# Dropping irrelevant columns
Spreadsheet = spreadsheet.drop(['Adjust', 'Volume', 'Change', 'Previous', 'CODE'], axis=1)
spreadsheet.head(5)

,DATE,CODE,NAME,12m Low,12m High,Day Low,Day High,Day Price,Previous,Change,Change%,Volume,Adjust
0,2-Jan-15,EGAD,Eaagads Ltd,8.2,14,42,42,42,42,-,-,-,-
1,2-Jan-15,KUKZ,Kakuzi Plc,300,423.5,180,180,180,180,-,-,"5,200",-
2,2-Jan-15,KAPC,Kapchorua Tea Kenya Plc,59,95,137,137,137,137,-,-,-,68.5
3,2-Jan-15,LIMT,Limuru Tea Plc,385,475,771,771,771,771,-,-,-,385.5
4,2-Jan-15,SASN,Sasini Plc,14.8,19.6,13,13,13,12.85,0.15,1.17%,"1,000",-

In [8]:
# Dropping duplicate rows
spreadsheet.shape

(16386, 13)

In [9]:
duplicate_rows_spreadsheet = spreadsheet[spreadsheet.duplicated()]
print("number of duplicate rows: ", duplicate_rows_spreadsheet.shape)

number of duplicate rows:  (0, 13)

In [10]:
# Removing duplicate data
spreadsheet.count()

DATE         16386
CODE         16386
NAME         16386
12m Low      16386
12m High     16386
Day Low      16386
Day High     16386
Day Price    16386
Previous     16386
Change       16386
Change%      16386
Volume       16386
Adjust       16386
dtype: int64

In [11]:
spreadsheet = spreadsheet.drop_duplicates()
spreadsheet.head(5)

,DATE,CODE,NAME,12m Low,12m High,Day Low,Day High,Day Price,Previous,Change,Change%,Volume,Adjust
0,2-Jan-15,EGAD,Eaagads Ltd,8.2,14,42,42,42,42,-,-,-,-
1,2-Jan-15,KUKZ,Kakuzi Plc,300,423.5,180,180,180,180,-,-,"5,200",-
2,2-Jan-15,KAPC,Kapchorua Tea Kenya Plc,59,95,137,137,137,137,-,-,-,68.5
3,2-Jan-15,LIMT,Limuru Tea Plc,385,475,771,771,771,771,-,-,-,385.5
4,2-Jan-15,SASN,Sasini Plc,14.8,19.6,13,13,13,12.85,0.15,1.17%,"1,000",-

In [12]:
spreadsheet.count()

DATE         16386
CODE         16386
NAME         16386
12m Low      16386
12m High     16386
Day Low      16386
Day High     16386
Day Price    16386
Previous     16386
Change       16386
Change%      16386
Volume       16386
Adjust       16386
dtype: int64

In [13]:
# Dropping missing or null values
print(spreadsheet.isnull().sum())

DATE         0
CODE         0
NAME         0
12m Low      0
12m High     0
Day Low      0
Day High     0
Day Price    0
Previous     0
Change       0
Change%      0
Volume       0
Adjust       0
dtype: int64

In [14]:
# Dropping missing values
spreadsheet = spreadsheet.dropna()
spreadsheet.count()

DATE         16386
CODE         16386
NAME         16386
12m Low      16386
12m High     16386
Day Low      16386
Day High     16386
Day Price    16386
Previous     16386
Change       16386
Change%      16386
Volume       16386
Adjust       16386
dtype: int64

In [15]:
# After dropping the values
print(spreadsheet.isnull().sum())

DATE         0
CODE         0
NAME         0
12m Low      0
12m High     0
Day Low      0
Day High     0
Day Price    0
Previous     0
Change       0
Change%      0
Volume       0
Adjust       0
dtype: int64